package cmd

import (
	"github.com/spf13/cobra"
)

var (
	ip = []int{
		58, 50, 42, 34, 26, 18, 10, 2,
		60, 52, 44, 36, 28, 20, 12, 4,
		62, 54, 46, 38, 30, 22, 14, 6,
		64, 56, 48, 40, 32, 24, 16, 8,
		57, 49, 41, 33, 25, 17, 9, 1,
		59, 51, 43, 35, 27, 19, 11, 3,
		61, 53, 45, 37, 29, 21, 13, 5,
		63, 55, 47, 39, 31, 23, 15, 7,
	}

	fp = []int{
		40, 8, 48, 16, 56, 24, 64, 32,
		39, 7, 47, 15, 55, 23, 63, 31,
		38, 6, 46, 14, 54, 22, 62, 30,
		37, 5, 45, 13, 53, 21, 61, 29,
		36, 4, 44, 12, 52, 20, 60, 28,
		35, 3, 43, 11, 51, 19, 59, 27,
		34, 2, 42, 10, 50, 18, 58, 26,
		33, 1, 41, 9, 49, 17, 57, 25,
	}

	// E-таблица для расширения 32-битного входа до 48 бит
	eTable = []int{
		32, 1, 2, 3, 4, 5,
		4, 5, 6, 7, 8, 9,
		8, 9, 10, 11, 12, 13,
		12, 13, 14, 15, 14, 15, 16, 17,
		16, 17, 18, 19, 18, 19, 20, 21,
		20, 21, 22, 23, 22, 23, 24, 25,
		24, 25, 26, 27, 26, 27, 28, 29,
		28, 29, 30, 31, 30, 31, 32, 1,
	}

	// P-таблица для перестановки после S-боксов
	pTable = []int{
		16, 7, 20, 21,
		29, 12, 28, 17,
		1, 15, 23, 26,
		5, 18, 31, 10,
		2, 8, 24, 14,
		32, 27, 3, 9,
		19, 13, 30, 6,
		22, 11, 4, 25,
	}

	// Таблицы G, H для генерации ключей
	gTable = []int{
		57, 49, 41, 33, 25, 17, 9,
		1, 58, 50, 42, 34, 26, 18,
		10, 2, 59, 51, 43, 35, 27,
		19, 11, 3, 60, 52, 44, 36,
		63, 55, 47, 39, 31, 23, 15,
		7, 62, 54, 46, 38, 30, 22,
		14, 6, 61, 53, 45, 37, 29,
		21, 13, 5, 28, 20, 12, 4,
	}

	hTable = []int{
		14, 17, 11, 24, 1, 5,
		3, 28, 15, 6, 21, 10,
		23, 19, 12, 4, 26, 8,
		16, 7, 27, 20, 13, 2,
		41, 52, 31, 37, 47, 55,
		30, 40, 51, 45, 33, 48,
		44, 49, 39, 56, 34, 53,
		46, 42, 50, 36, 29, 32,
	}

	shifts = []int{
		1, 1, 2, 2, 2, 2, 2, 2,
		1, 2, 2, 2, 2, 2, 2, 1,
	}

	// S-боксы для замены 6-битного входа на 4-битный выход
	sBoxes = [8][4][16]int{
		{
			{14, 4, 13, 1, 2, 15, 11, 8, 3, 10, 6, 12, 5, 9, 0, 7},
			{0, 15, 7, 4, 14, 2, 13, 1, 10, 6, 12, 11, 9, 5, 3, 8},
			{4, 1, 14, 8, 13, 6, 2, 11, 15, 12, 9, 7, 3, 10, 5, 0},
			{15, 12, 8, 2, 4, 9, 1, 7, 5, 11, 3, 14, 10, 0, 6, 13},
		},
		{
			{15, 1, 8, 14, 6, 11, 3, 4, 9, 7, 2, 13, 12, 0, 5, 10},
			{3, 13, 4, 7, 15, 2, 8, 14, 12, 0, 1, 10, 6, 9, 11, 5},
			{0, 14, 7, 11, 10, 4, 13, 1, 5, 8, 12, 6, 9, 3, 2, 15},
			{13, 8, 10, 1, 3, 15, 4, 2, 11, 6, 7, 12, 0, 5, 14, 9},
		},
		{
			{10, 0, 9, 14, 6, 3, 15, 5, 1, 13, 12, 7, 11, 4, 2, 8},
			{13, 7, 0, 9, 3, 4, 6, 10, 2, 8, 5, 14, 12, 11, 15, 1},
			{13, 6, 4, 9, 8, 15, 3, 0, 11, 1, 2, 12, 5, 10, 14, 7},
			{1, 10, 13, 0, 6, 9, 8, 7, 4, 15, 14, 3, 11, 5, 2, 12},
		},
		{
			{7, 13, 14, 3, 0, 6, 9, 10, 1, 2, 8, 5, 11, 12, 4, 15},
			{13, 8, 11, 5, 6, 15, 0, 3, 4, 7, 2, 12, 1, 10, 14, 9},
			{10, 6, 9, 0, 12, 11, 7, 13, 15, 1, 3, 14, 5, 2, 8, 4},
			{3, 15, 0, 6, 10, 1, 13, 8, 9, 4, 5, 11, 12, 7, 2, 14},
		},
		{
			{2, 12, 4, 1, 7, 10, 11, 6, 8, 5, 3, 15, 13, 0, 14, 9},
			{14, 11, 2, 12, 4, 7, 13, 1, 5, 0, 15, 10, 3, 9, 8, 6},
			{4, 2, 1, 11, 10, 13, 7, 8, 15, 9, 12, 5, 6, 3, 0, 14},
			{11, 8, 12, 7, 1, 14, 2, 13, 6, 15, 0, 9, 10, 4, 5, 3},
		},
		{
			{12, 1, 10, 15, 9, 2, 6, 8, 0, 13, 3, 4, 14, 7, 5, 11},
			{10, 15, 4, 2, 7, 12, 9, 5, 6, 1, 13, 14, 0, 11, 3, 8},
			{9, 14, 15, 5, 2, 8, 12, 3, 7, 0, 4, 10, 1, 13, 11, 6},
			{4, 3, 2, 12, 9, 5, 15, 10, 11, 14, 1, 7, 6, 0, 8, 13},
		},
		{
			{4, 11, 2, 14, 15, 0, 8, 13, 3, 12, 9, 7, 5, 10, 6, 1},
			{13, 0, 11, 7, 4, 9, 1, 10, 14, 3, 5, 12, 2, 15, 8, 6},
			{1, 4, 11, 13, 12, 3, 7, 14, 10, 15, 6, 8, 0, 5, 9, 2},
			{6, 11, 13, 8, 1, 4, 10, 7, 9, 5, 0, 15, 14, 2, 3, 12},
		},
		{
			{13, 2, 8, 4, 6, 15, 11, 1, 10, 9, 3, 14, 5, 0, 12, 7},
			{1, 15, 13, 8, 10, 3, 7, 4, 12, 5, 6, 11, 0, 14, 9, 2},
			{7, 11, 4, 1, 9, 12, 14, 2, 0, 6, 10, 13, 15, 3, 5, 8},
			{2, 1, 14, 7, 4, 10, 8, 13, 15, 12, 9, 0, 3, 5, 6, 11},
		},
	}
)

// Permute функция для перестановки битов входного числа согласно заданной таблице
func permute(input uint64, table []int, size int) uint64 {
	var output uint64
	for i, pos := range table {
		bit := (input >> (size - pos)) & 1
		output |= bit << (len(table) - 1 - i)
	}
	return output
}

// Feistel f функция, которая принимает 32-битный вход и 48-битный ключ, выполняет расширение, XOR с ключом, S-боксы и перестановку P
func feistel(input uint32, key uint64) uint32 {
	expanded := permute(uint64(input), eTable, 32)
	x := expanded ^ key

	var output uint32
	for i := 0; i < 8; i++ {
		// получаем конкретный блок из 6 бит
		block := (x >> (42 - 6*i)) & 0x3F
		// получаем строку и столбец для S-бокса
		// 001111 -> 00 (строка) и 1111 (столбец)
		col := block & 0x0F
		row := (block >> 4) & 0x03
		// получаем значение из S-бокса и добавляем его в выходной результат
		sValue := sBoxes[i][row][col]
		output |= uint32(sValue) << (28 - 4*i)
	}

	output = uint32(permute(uint64(output), pTable, 32))

	return output
}

func generateKeys(key uint64) [16]uint64 {
	var keys [16]uint64
	k := permute(key, gTable, 64)
	c := uint32(k >> 28)        // старшие 28 бит
	d := uint32(k & 0x0FFFFFFF) // младшие 28 бит

	// Генерация 16 ключей для 16 раундов
	for i := 0; i < 16; i++ {
		c = (c << shifts[i]) | (c >> (28 - shifts[i])) // циклический сдвиг влево
		d = (d << shifts[i]) | (d >> (28 - shifts[i])) // циклический сдвиг влево
		cd := (uint64(c) << 28) | uint64(d)            // объединяем C и D
		keys[i] = permute(cd, hTable, 56)              // применяем PC-2 для получения 48-битного ключа
	}

	return keys
}

func desEncryptBlock(block uint64, key uint64) uint64 {
	// Начальная перестановка
	block = permute(block, ip, 64)
	keys := generateKeys(key)
	left := uint32(block >> 32)         // старшие 32 бита
	right := uint32(block & 0xFFFFFFFF) // младшие 32 бита

	// 16 раундов шифрования
	for i := 0; i < 16; i++ {
		newRight := left ^ feistel(right, keys[i]) // новый правый блок
		left = right                               // старый правый блок становится левым
		right = newRight                           // новый правый блок становится правым
	}

	// Объединяем левый и правый блоки и применяем обратную перестановку
	preOutput := (uint64(right) << 32) | uint64(left) // объединяем правый и левый блоки
	cipherBlock := permute(preOutput, fp, 64)         // обратная перестановка
	return cipherBlock
}

func desDecryptBlock(block uint64, key uint64) uint64 {
	// Начальная перестановка
	block = permute(block, ip, 64)
	keys := generateKeys(key)
	left := uint32(block >> 32)         // старшие 32 бита
	right := uint32(block & 0xFFFFFFFF) // младшие 32 бита

	// 16 раундов дешифрования (ключи в обратном порядке)
	for i := 15; i >= 0; i-- {
		newRight := left ^ feistel(right, keys[i]) // новый правый блок
		left = right                               // старый правый блок становится левым
		right = newRight                           // новый правый блок становится правым
	}

	// Объединяем левый и правый блоки и применяем обратную перестановку
	preOutput := (uint64(right) << 32) | uint64(left) // объединяем правый и левый блоки
	plainBlock := permute(preOutput, fp, 64)          // обратная перестановка
	return plainBlock
}

func bytesToUint64(b []byte) uint64 {
	v := uint64(0)
	for i := 0; i < 8; i++ {
		v |= uint64(b[i]) << (56 - 8*i)
	}
	return v
}

func uint64ToBytes(v uint64) []byte {
	bytes := make([]byte, 8)
	for i := 0; i < 8; i++ {
		bytes[i] = byte((v >> (56 - 8*i)) & 0xFF)
	}
	return bytes
}

func pad(data []byte) []byte {
	padding := 8 - (len(data) % 8)
	for i := 0; i < padding; i++ {
		data = append(data, byte(padding))
	}
	return data
}

func unpad(data []byte) []byte {
	padding := int(data[len(data)-1])
	return data[:len(data)-padding]
}

func desEncode(data []byte, key uint64) []byte {
	var result []byte
	for i := 0; i < len(data); i += 8 {
		block := bytesToUint64(data[i : i+8])
		encryptedBlock := desEncryptBlock(block, key)
		result = append(result, uint64ToBytes(encryptedBlock)...)
	}
	return result
}

func desDecode(data []byte, key uint64) []byte {
	var result []byte
	for i := 0; i < len(data); i += 8 {
		block := bytesToUint64(data[i : i+8])
		decryptedBlock := desDecryptBlock(block, key)
		result = append(result, uint64ToBytes(decryptedBlock)...)
	}
	return result
}

func getKeys(cmd *cobra.Command) (uint64, uint64, uint64) {
	key1, _ := cmd.Flags().GetUint64("key1")
	key2, _ := cmd.Flags().GetUint64("key2")
	key3, _ := cmd.Flags().GetUint64("key3")

	return key1, key2, key3
}
